BTN_TEXT = {
    'til': ["🇺🇿 Ўзбек тили", "🇷🇺 Русский"],
    'uz': {
        'boshlash': ['Сўровномани бошлаш ✅'],
        'shaxs': ["Жисмоний шахс", "Тадбиркор"],
        'hudud': {
            'Андижон вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк', 'Инвест Финанс банк', 'Ипак Йўли банк',
                'Ипотека-банк', 'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Траст банк', 'Турон банк', 'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк',
                'Халқ банки', 'Ҳамкорбанк'
            ],
            'Бухоро вилояти': [
                'Агробанк', 'Азия Альянс банк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки', 'Ҳамкорбанк'
            ],
            'Жиззах вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк', 'Ипотека-банк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк',
                'Халқ банки', 'Ҳамкорбанк'
            ],
            'Қашқадарё вилояти': [
                'Агробанк', 'Азия Альянс банк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Универсал банк', 'Ўзмиллийбанк',
                'Ўзсаноатқурилишбанк', 'Халқ банки', 'Ҳамкорбанк'
            ],
            'Қорақалпоғистон Республикаси': [
                'Агробанк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
            'Навоий вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Турон банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
            'Наманган вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк', 'Универсал банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
            'Самарқанд вилояти': [
                'Агробанк', 'Азия Альянс банк', 'Алоқа банк', 'Асака банк',
                'Зираат банк', 'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Тенге банк', 'Траст банк', 'Турон банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки', 'Ҳамкорбанк'
            ],
            'Сирдарё вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк', 'Ипотека-банк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Ўзмиллийбанк',
                'Ўзсаноатқурилишбанк', 'Халқ банки', 'Ҳамкорбанк'
            ],
            'Сурхондарё вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Савдогар банк', 'Траст банк',
                'Турон банк', 'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
            'Тошкент вилояти': [
                'Агробанк', 'Алоқа банк', 'Давр банк', 'Инвест Финанс банк',
                'Ипак Йўли банк', 'Ипотека-банк', 'Қишлоқ қурилиш банк', 'Микрокредитбанк',
                'Ориент Финанс банк', 'Савдогар банк', 'Траст банк', 'Туркистон банк',
                'Турон банк', 'Универсал банк', 'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк',
                'Халқ банки', 'Ҳамкорбанк'
            ],
            'Тошкент шаҳри': [
                'Агробанк', 'Азия Альянс банк', 'Алоқа банк', 'Анор банк', 'Асака банк', 'Давр банк',
                'Зираат банк', 'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Пойтахт банк', 'Равнақ-банк', 'Савдогар банк', 'Тенге банк', 'Тибиси банк - TBC',
                'Траст банк', 'Туркистон банк', 'Турон банк', 'Универсал банк', 'Ўзагроэкспортбанк',
                'ЎзКДБ банк', 'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Хай-Тек банк', 'Халқ банки',
                'Ҳамкорбанк', 'Эрон Содерот банк'
            ],
            'Фарғона вилояти': [
                'Агробанк', 'Азия Альянс банк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Мадад инвест банк', 'Микрокредитбанк',
                'Савдогар банк', 'Тенге банк',
                'Траст банк', 'Турон банк', 'Универсал банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
            'Хоразм вилояти': [
                'Агробанк', 'Алоқа банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Қишлоқ қурилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Ўзмиллийбанк', 'Ўзсаноатқурилишбанк', 'Халқ банки',
                'Ҳамкорбанк'
            ],
        },
        'ish_karta': ["Ҳа", "Йўқ"],
        'sabab': [
            "Тавсияга кўра", "Хизматларнинг ҳамёнбоплиги", "Сифатли хизмат кўрсатилиши",
            "Кредит маҳсулотларнинг оммабоплиги", "Банкнинг таниқлилиги",
            "Хизмат кўрсатиш шартларининг содда ва тушунарли эканлиги",
            "Банкнинг ишончлилиги", "Тезкор хизмат кўрсатилиши",
            "Банк томонидан кенг турдаги хизматлар таклиф этилиши",
            "Филиалларнинг қулай жойлашуви", "Масофавий хизмат кўрсатиш тизимининг мавжудлиги",
            "Бошқа:",
        ],
        'tashrif': [
            "Ҳар куни", "Ҳар ҳафтада", "Ҳар ойда",
            "Банкка бормайман, банк мобил иловасидан фойдаланаман",
            "Бошқа муддатларда",
        ],
        'mahsulot': [
            "Кредитлар", "Омонатлар – депозитлар", "Тўловлар",
            "Валюта айирбошлаш", "Пул ўтказмалари", "Бошқа:"
        ],
        'kreditlar': {
            'first': [
                "Ҳа, иш ҳақи картамга хизмат кўрсатувчи банкда кредитим мавжуд", "Ҳа, бошқа банкда кредитим мавжуд",
                "Йўқ, кредит хизматидан фойдаланмайман",
            ],
            'xizmat': [
                "Микроқарз", "Ипотека кредити", "Таълим кредити", "Истеъмол кредити",
                "Автокредит", "Бошқа:"
            ],
            'sabab': [
                "Ҳамёнбоп шартлар: фоиз ставкалари ва бошқалар", "Кредит олиш жараёнининг соддалиги",
                "Кредит олиш эҳтимолининг бошқа банкларга нисбатан юқорилиги",
                "Кредитни онлайн расмийлаштириш имкониятининг мавжудлиги", "Тавсия қилишган",
                "Банкка нисбатан содиқлик", "Жавоб беришга қийналаман", "Бошқа сабаб:"
            ],
            'sondirish': [
                "Бевосита банк офисига ташриф буюрган ҳолда", "Мобил илова ёрдамида"
            ],
            'bank': [
                "Тўловларни масофавий амалга ошириш шаклига ишончсизлик", "Тўлов чекининг қоғоз шакли мавжудлиги",
                "Даромадларим нақд пулда", "Мобил иловалардан фойдаланишни билмайман",
                "Жавоб беришга қийналаман",  "Бошқа:"
            ],
            'mobil': {
                'first': [
                    "Тўловларнинг тезкорлиги: навбатлар бўлмаслиги", "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                    "Тўловлар тарихини кузатиб бориш имкониятининг мавжудлиги",
                    "Исталган вақтда ва жойда тўлов қилиш имкониятининг мавжудлиги",
                    "Жавоб беришга қийналаман", "Бошқа:"
                ],
                'ilova': [
                    "Иш ҳақи картамга хизмат кўрсатувчи банкнинг мобил иловаси", "Бошқа банкнинг мобил иловаси",
                    "Тўлов ташкилотларининг мобил иловаси: Payme, Click ва бошқалар"
                ],
                'xabar': [
                    "Ҳа, доим хабардор қилиб туради",  "Баъзида хабардор қилиб туради", "Хеч қачон хабардор қилмаган"
                ],
                'baholash': [
                    "Жуда қулай", "Фойдаланиш қийин", "Умуман ноқулай", "Жавоб беришга қийналаман",
                ],
            },
        },
        'omonatlar': {
            'first': [
                "Ҳа, иш ҳақи картамга хизмат кўрсатувчи банкда мавжуд", "Ҳа, бошқа банкда мавжуд", "Йўқ, мавжуд эмас",
            ],
            'sabab': [
                "Ҳамёнбоп шартлар (фоиз ставкалари ва бошқалар)",
                "Омонат (депозит)ларни онлайн бошқариш имкониятининг мавжудлиги",
                "Омонат (депозит) бўйича маблағларни шартномада белгиланган муддатларда ечиб олиш имконияти мавжудлиги",
                "Банкка нисбатан ишонч",
                "Жавоб беришга қийналаман", "Бошқа сабаб"
            ],
            'shakl': [
                "Бевосита банк офисига ташриф буюриш", "Мобил илова ёрдамида"
            ],
            'bank': {
                'first': [
                    "Омонат(депозит)ларни масофавий хизмат кўрсатиш тизими орқали бошқариш шаклига ишончсизлик",
                    "Омонат дафтарчасининг мавжудлиги", "Даромадларим нақд пулда",
                    "Мобил иловалардан фойдаланишни билмайман",
                    "Банк мобил иловасида омонат-депозит тўғрисида батафсил маълумот олиш имкониятининг мавжуд эмаслиги",
                    "Бошқа:"
                ],
                'baholash': [
                    "Тезкор", "Кутишга тўғри келади", "Ниҳоятда секин", "Бошқа:",
                ],
            },
            'mobil': {
                'first': [
                    "Тўловларнинг тезкорлиги (навбатлар бўлмаслиги)", "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                    "Омонат амалиётлари тарихини кузатиб бориш имкониятининг мавжудлиги",
                    "Исталган вақтда ва жойда амалиёт бажариш имкониятининг мавжудлиги",
                    "Жавоб беришга қийналаман", "Бошқа:"
                ],
                'boshqarish': [
                    "Иш ҳақи картамга хизмат кўрсатувчи банкнинг мобил иловасидан", "Бошқа банкнинг мобил иловасидан"
                ],
                'shartnoma': [
                    "Ҳа, тўлиқ риоя қилади", "Баъзида риоя қилмайди",
                    "Йўқ, умуман риоя қилмайди", "Жавоб беришга қийналаман"
                ],
                'baholash': [
                    "Жуда қулай", "Фойдаланиш қийин", "Умуман ноқулай", "Жавоб беришга қийналаман"
                ],
            },
        },
        'tolovlar': {
            'first': [
                "Нақд пулда", "Нақд пулсиз"
            ],
            'naqd_pul': [
                "Тўловларни масофавий амалга ошириш шаклига ишончсизлик", "Тўлов чекининг қоғоз шакли мавжудлиги",
                "Даромадларим нақд пулда", "Тўловлар учун комиссия мавжуд эмаслиги",
                "Терминаллар фаолиятида тез-тез узилишлар кузатилиши", "Жавоб беришга қийналаман", "Бошқа"
            ],
            'naqd_pulsiz': [
                "Тўловларнинг тезкорлиги (навбатлар бўлмаслиги)",
                "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                "Тўловлар тарихини кузатиб бориш имкониятининг мавжудлиги",
                "Исталган вақтда ва жойда тўлов қилиш имкониятининг мавжудлиги",
                "Кешбек мавжудлиги", "Бошқа сабаб",
            ],
            'mobil': {
                # 'sabab': [
                #     "Тўловларнинг тезкорлиги (навбатлар бўлмаслиги)",
                #     "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                #     "Тўловлар тарихини кузатиб бориш имкониятининг мавжудлиги",
                #     "Исталган вақтда ва жойда тўлов қилиш имкониятининг мавжудлиги",
                #     "Кешбек мавжудлиги", "Бошқа сабаб",
                # ],
                'first': [
                    "Хизмат кўрсатувчи банкнинг мобил иловаси", "Бошқа банкнинг мобил иловаси",
                    "Тўлов ташкилотларининг мобил иловалари (Payme, Click ва бошқалар)"
                ],

                'tur1': [
                    "Ҳамёнбоп шартлар (комиссиялар)", "Кенг турдаги тўлов хизматларининг мавжудлиги",
                    "Тўловларни амалга ошириш жараёнининг соддалиги",
                    "Мобил илованинг ишлаш тезлиги",
                    "Кешбек мавжудлиги",
                ],
                'tur1third': [
                    "Ҳамёнбоп шартлар (комиссиялар)", "Кенг турдаги тўлов хизматларининг мавжудлиги",
                    "Тўловларни амалга ошириш жараёнининг соддалиги",
                    "Интернет тармоғига уланмасдан, офлайн режимида ишлаши",
                    "Мобил илованинг ишлаш тезлиги", "Кешбек мавжудлиги",
                ],
                'yulduzcha': [
                    '⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️',
                    '⭐️⭐️⭐️', '⭐️⭐️', '⭐️'
                ],
                'yulduzchathird': [
                    '⭐️⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️',
                    '⭐️⭐️⭐️', '⭐️⭐️', '⭐️'
                ],
                'tur2': [
                    "Кредитни сўндириш", "Коммунал хизматлар учун тўловлар",
                    "Ижтимоий тўловлар (таълим, суғурта, интернет, телефон ва бошқалар)",
                    "P2P ўтказмалар (картадан картага маблағ ўтказиш)",
                    "Давлат хизматлари ва жарималар (солиқ, ЙҲХББ жарималари ва бошқалар)",
                    "Онлайн буюртмалар (маҳсулот/хизмат етказиб бериш ва бошқалар)"
                ],
                'baholash': [
                    "Жуда қулай", "Фойдаланиш учун қийин", "Умуман ноқулай", "Жавоб беришга қийналаман",
                ],
            },
        },
        'valyuta': {
            'first': [
                "Нақд пулда: валюта айирбошлаш шохобчаларида", "Нақд пулсиз шаклда: мобил илова орқали", "Бошқа:"
            ],
            'naqd_pul': [
                "Валюта айирбошлаш амалиётини масофавий хизмат кўрсатиш тизими орқали бажаришга ишончсизлик",
                "Амалиёт чекининг қоғоз шакли мавжудлиги", "Даромадларим нақд пулда",
                "Мобил иловалардан фойдаланишни билмайман", "Бошқа:",
            ],
            'mobil': {
                'first': [
                    "Иш ҳақи картамга хизмат кўрсатувчи банкнинг мобил иловасидан", "Бошқа банкнинг мобил иловасидан"
                ],
                'sabab': [
                    "Ҳамёнбоп шартлар: алмаштириш курси", "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                    "Валюта айирбошлаш амалиётлари тарихини кузатиб бориш имкониятининг мавжудлиги",
                    "Тўловларнинг тезкорлиги: навбатлар бўлмаслиги", "Комиссияларнинг мавжуд эмаслиги",
                    "Исталган вақтда ва жойда амалиёт бажариш имкониятининг мавжудлиги",
                    "Жавоб беришга қийналаман", "Бошқа"
                ],
                'baholash': [
                    "Жуда қулай", "Фойдаланиш қийин", "Умуман ноқулай", "Жавоб беришга қийналаман"
                ],
            },
        },
        'transfer': {
            'first': [
                "Нақд пулда: бевосита банк офисига ташриф буюриш", "Нақд пулсиз шаклда: мобил илова орқали", "Бошқа:"
            ],
            'naqd_pul': {
                'first': [
                    "Пул ўтказмаларини масофавий хизмат кўрсатиш тизими орқали бажариш амалиётига ишончсизлик",
                    "Амалиёт чекининг қоғоз шакли мавжудлиги", "Даромадларим нақд пулда",
                    "Мобил иловалардан фойдаланишни билмайман",
                    "Хизмат кўрсатувчи банк пул ўтказмазмаси амалиётини мобил илова орқали "
                    "амалга ошириш имкониятини тақдим этмайди", "Бошқа"
                ],
                'baholash': [
                    "Тезкор", "Кутишга тўғри келади", "Ниҳоятда секин", "Бошқа:"
                ],
            },
            'mobil': {
                'first': [
                    "Иш ҳақи картамга хизмат кўрсатувчи банкнинг мобил иловасидан", "Бошқа банкнинг мобил иловасидан",
                ],
                'sabab': [
                    "Ҳамёнбоп шартлар: комиссиялар", "Ортиқча қоғозбозликнинг мавжуд эмаслиги",
                    "Пул ўтказмалари амалиётлари тарихини кузатиб бориш имкониятининг мавжудлиги",
                    "Тўловларнинг тезкорлиги: навбатлар бўлмаслиги",
                    "Исталган вақтда ва жойда амалиёт бажариш имкониятининг мавжудлиги",
                    "Жавоб беришга қийналаман", "Бошқа"
                ],
                'baholash': [
                    "Жуда қулай", "Фойдаланиш қийин", "Умуман ноқулай", "Жавоб беришга қийналаман"
                ],
            },
        },
        'back': ['↩️ Ортрга қайтиш'],
        'next': ['Кейингиси ⏩'],
        'continue': ['Давом этиш ➡️️'],
    },
    # ru                 #############
    'ru': {
        'boshlash': ['Начать опрос ✅'],
        'shaxs': ["Физическое лицо", "Предприниматель"],
        'hudud': {
            'Андижанская область': [
                'Агробанк', 'Алока банк', 'Асака банк', 'Инвест Финанс банк', 'Ипак Йўли банк',
                'Ипотека-банк', 'Кишлок курилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Траст банк', 'Турон банк', 'Узнацбанк', 'Узпромстройбанк',
                'Народный банк', 'Хамкорбанк'
            ],
            'Бухарская область': [
                'Агробанк', 'Азия Альянс банк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Джизакская область': [
                'Агробанк', 'Алока банк', 'Асака банк', 'Ипотека-банк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Народный банк', 'Узпромстройбанк',
                'Хамкорбанк'
            ],
            'Кашкадарьинская область': [
                'Агробанк', 'Азия Альянс банк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Универсал банк', 'Узнацбанк',
                'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Республика Каракалпакстан': [
                'Агробанк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Навоийская область': [
                'Агробанк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк',
                'Кишлок курилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Турон банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Наманганская область': [
                'Агробанк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк', 'Универсал банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Самаркандская область': [
                'Агробанк', 'Азия Альянс банк', 'Алока банк', 'Асака банк',
                'Зираат банк', 'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Савдогар банк', 'Тенге банк', 'Траст банк', 'Турон банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк', 'Хамкорбанк'
            ],
            'Сырдарьинская область': [
                'Агробанк', 'Алока банк', 'Асака банк', 'Ипотека-банк',
                'Кишлок қурилиш банк', 'Микрокредитбанк', 'Савдогар банк',
                'Траст банк', 'Турон банк', 'Узнацбанк',
                'Узпромстройбанк', 'Народный банки', 'Хамкорбанк'
            ],
            'Сурхандарьинская область': [
                'Агробанк', 'Алока банк', 'Асака банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Савдогар банк', 'Траст банк',
                'Турон банк', 'Узнацбанк', 'Узпромстройбанк', 'Народный банк',
                'Хамкорбанк'
            ],
            'Ташкентская область': [
                'Агробанк', 'Алока банк', 'Давр банк', 'Инвест Финанс банк',
                'Ипак Йўли банк', 'Ипотека-банк', 'Кишлок курилиш банк', 'Микрокредитбанк',
                'Ориент Финанс банк', 'Савдогар банк', 'Траст банк', 'Туркистон банк',
                'Турон банк', 'Универсал банк', 'Узнацбанк', 'Узпромстройбанк',
                'Народный банк', 'Хамкорбанк'
            ],
            'г. Ташкент': [
                'Агробанк', 'Азия Альянс банк', 'Алока банк', 'Анор банк', 'Асака банк', 'Давр банк',
                'Зираат банк', 'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк', 'Ориент Финанс банк',
                'Пойтахт банк', 'Равнак-банк', 'Савдогар банк', 'Тенге банк', 'Тибиси банк - TBC',
                'Траст банк', 'Туркистон банк', 'Турон банк', 'Универсал банк', 'Ўзагроэкспортбанк',
                'ЎзКДБ банк', 'Узнацбанк', 'Узпромстройбанк', 'Хай-Тек банк', 'Народный банк',
                'Хамкорбанк', 'Банк Садерат Ирана'
            ],
            'Ферганская область': [
                'Агробанк', 'Азия Альянс банк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипак Йўли банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Мадад инвест банк', 'Микрокредитбанк',
                'Савдогар банк', 'Тенге банк',
                'Траст банк', 'Турон банк', 'Универсал банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк',
                'Хамкорбанк'
            ],
            'Хорезмская область': [
                'Агробанк', 'Алока банк', 'Асака банк',
                'Инвест Финанс банк', 'Ипотека-банк', 'Капиталбанк',
                'Кишлок курилиш банк', 'Микрокредитбанк',
                'Савдогар банк', 'Траст банк', 'Турон банк',
                'Узнацбанк', 'Узпромстройбанк', 'Народный банк',
                'Хамкорбанк'
            ],
        },
        'ish_karta': ["Да", "Нет"],
        'sabab': [
            "По рекомендации", "Выгодные условия обслуживания", "Качество обслуживания",
            "Доступность кредитных продуктов", "Популярность банка",
            "Понятные условия обслуживания",
            "Надежность банка", "Оперативность обслуживания",
            "Широкий спектр услуг, предоставляемых банком",
            "Удобство расположения отделений", "Доступность дистанционного банковского обслуживания",
            "Зарплатный проект организации обслуживается этим банком", "Другое",
        ],
        'tashrif': [
            "Ежедневно", "Еженедельно", "Ежемесячно",
            "Не посещаю банк, пользуюсь мобильным приложением",
            "Другая частота",
        ],
        'mahsulot': [
            "Кредиты", "Вклады – депозиты", "Платежи",
            "Обмен валют", "Денежные переводы", "Другое"
        ],
        'kreditlar': {
            'first': [
                "Да, имеется в обслуживающем зарплатную карту банке",
                "Да, имеется в другом банке",
                "Нет, не имеется"
            ],
            'xizmat': [
                "Микрозайм", "Ипотечный кредит", "Образовательный кредит", "Потребительский кредит",
                "Автокредит", "Другое"
            ],
            'sabab': [
                "Выгодные условия (процентная ставка и др.)", "Простота процесса получения кредита",
                "Вероятность получения кредита в банке выше, чем в прочих банках",
                "Наличие возможности онлайн оформления кредитов", "По рекомендации",
                "Лояльность к банку", "Затрудняюсь ответить", "Другая причина"
            ],
            'sondirish': [
                "Непосредственное посещение офиса банка", "Посредством мобильного приложения"
            ],
            'bank': [
                "Недоверие дистанционным формам платежа", "Наличие бумажного чека оплаты",
                "Доходы в наличной форме", "Неумение пользоваться мобильным приложением",
                "Затрудняюсь ответить", "Другое"
            ],
            'mobil': {
                'first': [
                    "Быстрота платежа: отсутствие очереди", "Отсутствие бумажной волокиты",
                    "Возможность отслеживания платежной истории",
                    "Отсутствие ограничений по времени и месту платежа",
                    "Затрудняюсь ответить", "Другое"
                ],
                'ilova': [
                    "Мобильное приложение обслуживающего зарплатную карту банка", "Мобильное приложение другого банка",
                    "Мобильное приложение платежных организаций: Payme, Click, Paynet и др."
                ],
                'xabar': [
                    "Да, постоянно уведомляет",  "Иногда уведомляет", "Никогда не получал уведомлений"
                ],
                'baholash': [
                    "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить",
                ],
            },
        },
        'omonatlar': {
            'first': [
                "Да, имеется в банке, обслуживающем зарплатную карту", "Да, имеется в другом банке", "Нет, не имеется",
            ],
            'sabab': [
                "Выгодные условия (процентная ставка и др.)",
                "Наличие возможности онлайн управления вкладом (депозитом)",
                "Возможность снятия средств в установленные договором сроки",
                "Доверие к банку",
                "Затрудняюсь ответить", "Другая причина"
            ],
            'shakl': [
                "Непосредственное посещение офиса банка", "Посредством мобильного приложения"
            ],
            'bank': {
                'first': [
                    "Недоверие дистанционным формам управления вкладом-депозитом",
                    "Наличие вкладной книжки", "Доходы в наличной форме",
                    "Неумение пользоваться мобильным приложением",
                    "Отсутствие возможности получения полной информации по вкладу-депозиту в приложении банка",
                    "Другое"
                ],
                'baholash': [
                    "Оперативно", "Приходится ждать", "Крайне медленно", "Другое",
                ],
            },
            'mobil': {
                'first': [
                    "Быстрота операций: отсутствие очереди", "Отсутствие бумажной волокиты",
                    "Возможность отслеживания вкладной истории",
                    "Отсутствие ограничений по времени и месту операций",
                    "Затрудняюсь ответить", "Другое"
                ],
                'boshqarish': [
                    "Мобильное приложение банка, обслуживающего зарплатную карту ", "Мобильное приложение другого банка"
                ],
                'shartnoma': [
                    "Да, полностью соблюдает", "Иногда не соблюдает",
                    "Нет, полностью нарушает", "Затрудняюсь ответить"
                ],
                'baholash': [
                    "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить"
                ],
            },
        },
        'tolovlar': {
            'first': [
                "Наличные платежи", "Безналичные платежи"
            ],
            'naqd_pul': [
                "Недоверие дистанционным формам платежа", "Наличие бумажного чека оплаты",
                "Доходы в наличной форме", "Отсутствие комиссий за платежи",
                "Частые сбои в работе терминалов", " Затрудняюсь ответить", "Другое"
            ],
            'naqd_pulsiz': [
                "Быстрота платежа (отсутствие очереди)", "Отсутствие бумажной волокиты",
                "Возможность отслеживания платежной истории",
                "Отсутствие ограничений по времени и месту платежа",
                "Наличие кэшбека", "Затрудняюсь ответить", "Другое",
            ],
            'mobil': {
                'first': [
                    "Мобильное приложение банка, обслуживающего зарплатную карту",
                    "Мобильное приложение другого банка",
                    "Мобильное приложение платежных организаций (Payme, Click и др.)"
                ],
                # 'sabab': [
                #     "Выгодные условия: комиссии",
                #     "Наличие дистанционных форм оплаты посредством приложения банка",
                #     "Оперативность и качество обслуживания", "Затрудняюсь ответить", "Другая причина",
                # ],
                'tur1': [
                    "Выгодные условия (комиссии)", "Широкий спектр платежных услуг",
                    "Простота совершения платежей",
                    "Скорость работы приложения",
                    "Наличие кэшбека",
                ],
                'tur1third': [
                    "Выгодные условия (комиссии)", "Широкий спектр платежных услуг",
                    "Простота совершения платежей",
                    "Функционирование в офлайн режиме вне зависимости от подключения к сети интернет",
                    "Скорость работы приложения",
                    "Наличие кэшбека",
                ],
                'yulduzcha': [
                    '⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️',
                    '⭐️⭐️⭐️', '⭐️⭐️', '⭐️'
                ],
                'yulduzchathird': [
                    '⭐️⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️⭐️', '⭐️⭐️⭐️⭐️',
                    '⭐️⭐️⭐️', '⭐️⭐️', '⭐️'
                ],
                'tur2': [
                    "Погашение кредита", "Оплата за коммунальные услуги",
                    "Социальные платежи (образование, страхование, интернет, телефония и др.)",
                    "P2P переводы (переводы между картами)",
                    "Государственные услуги и штрафы (налоги, штрафы и др.)",
                    "Онлайн заказы (доставка товаров/услуг и др.)"
                ],
                'baholash': [
                    "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить",
                ],
            },
        },
        'valyuta': {
            'first': [
                "Наличная: в обменных пунктах", "Безналичная: через мобильное приложение", "Другое"
            ],
            'naqd_pul': [
                "Недоверие дистанционным формам обмена валют",
                "Наличие бумажного чека", "Доходы в наличной форме",
                "Неумение пользоваться мобильным приложением", "Другое",
            ],
            'mobil': {
                'first': [
                    "Мобильное приложение банка, обслуживающего зарплатную карту", "Мобильное приложение другого банка"
                ],
                'sabab': [
                    "Выгодные условия: курс обмена", "Отсутствие бумажной волокиты",
                    "Возможность отслеживания валютообменной истории",
                    "Быстрота операций: отсутствие очереди", "Отсутствие комиссий",
                    "Отсутствие ограничений по времени и месту операций",
                    "Затрудняюсь ответить", "Другое"
                ],
                'baholash': [
                    "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить",
                ],
            },
        },
        'transfer': {
            'first': [
                "Наличная: непосредственное посещение офиса банка", "Безналичная: через мобильное приложение", "Другое"
            ],
            'naqd_pul': {
                'first': [
                    "Недоверие дистанционным формам осуществления денежных переводов",
                    "Наличие бумажного чека", "Доходы в наличной форме",
                    "Неумение пользоваться мобильным приложением",
                    "Обслуживающий банк не предлагает услуги по денежным переводам посредством мобильного приложения",
                    "Другое"
                ],
                'baholash': [
                    "Оперативно", "Приходится ждать", "Крайне медленно", "Другое: введите текст",
                ],
            },
            'mobil': {
                'first': [
                    "Мобильное приложение обслуживающего банка", "Мобильное приложение другого банка",
                ],
                'sabab': [
                    "Выгодные условия: комиссии", "Отсутствие бумажной волокиты",
                    "Возможность отслеживания истории по операциям",
                    "Быстрота операций: отсутствие очереди",
                    "Отсутствие ограничений по времени и месту операций",
                    "Затрудняюсь ответить", "Другое"
                ],
                'baholash': [
                    "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить",
                ],
            },
        },
        'back': ['↩️ Вернуться назад'],
        'next': ['Далее ⏩'],
        'continue': ['Дальше ➡️'],
    },
}

YUR_BTN_TEXT = {
    'uz': {
        'mahsulot': [
            "Кредитлар", "Депозитлар", "Ҳисоб рақам юритиш", "Валюта конвертацияси", "Бошқа"
        ],
        'kreditlar': {
            'first': [
                "Ҳа, асосий ҳисоб рақамга хизмат кўрсатувчи банкда мавжуд",
                "Ҳа, бошқа банкда мавжуд", "Йўқ, мавжуд эмас"
            ],
            'xizmat': [
                "Айланма маблағни тўлдириш", "Асосий воситалар сотиб олиш", "Микрокредит", "Автокредит", "Бошқа"
            ],
            'sabab': [
                "Ҳамёнбоп шартлар: фоиз ставкалари ва бошқалар", "Кредит олиш жараёнининг соддалиги",
                "Кредит олиш эҳтимолининг бошқа банкларга нисбатан юқорилиги",
                "Тавсия қилишган", "Банкка нисбатан содиқлик", "Бошқа сабаб",
            ],
            'xabar': [
                "Ҳа, доим хабардор қилиб туради",  "Баъзида хабардор қилиб туради", "Хеч қачон хабардор қилмаган"
            ],
            'baholash': [
                "Жуда қулай", "Фойдаланиш қийин", "Умуман ноқулай", "Жавоб беришга қийналаман",
            ]
        },
        'omonatlar': {
            'first': [
                "Ҳа, хизмат кўрсатувчи банкда мавжуд", "Ҳа, бошқа банкда мавжуд", "Йўқ, мавжуд эмас",
            ],
            'sabab': [
                "Ҳамёнбоп шартлар (фоиз ставкалари ва бошқалар)", "Банкка нисбатан ишонч",
                "Шартнома шартларининг банк томонидан  ўз вақтида бажарилиши (фоизларни тўлаш ва бошқалар)",
                "Депозит операцияларини амалга ошириш жараёнининг содда эканлиги",
                "Банкка нисбатан содиқлик", "Бошқа сабаб"
            ]
        },
        'hisob': {
            'first': [
                "Ҳамёнбоп шартлар (дебет айланма учун коммиссия  ва бошқалар)", "Банкка нисбатан ишонч",
                "Мажбуриятларнинг банк томонидан ўз вақтида бажарилиши", "Хизмат кўрсатиш сифати",
                "Банкка нисбатан содиқлик", "Кўрсатиладиган хизматларнинг кенг турлари",
                "Масофавий хизмат кўрсатиш каналларининг ривожланганлиги", "Бошқа сабаб"
            ],
            'vaqt': [
                "Ҳа, доим тезкор", "Баъзида кутишга тўғри келади", "Йўқ, тўловлар доим кечиктириб ўтказилади"
            ],
            'xato': [
                "Ҳа, доим хатолик ва ноаниқликлар бўлади", "Баъзида хатолик ва ноаниқликлар бўлади",
                "Йўқ, хатолик умуман бўлмайди"
            ]
        },
        'valyuta': {
            'first': [
                "Ҳамёнбоп шартлар (алмашув курси)", "Банкнинг ишончлилиги", "Хизмат кўрсатишнинг тезкорлиги", "Бошқа"
            ]
        }
    },
    'ru': {
        'mahsulot': [
            "Кредиты", "Депозиты", "Ведение расчетного счета", "Конвертация валюты", "Другое"
        ],
        'kreditlar': {
            'first': [
                "Да, имеется в банке, обслуживающем основной счёт",
                "Да, имеется в другом банке", "Нет, не имеется"
            ],
            'xizmat': [
                "Пополнение оборотного капитала", "Покупка основных средств", "Микрокредит", "Автокредит", "Другой"
            ],
            'sabab': [
                "Выгодные условия (процентная ставка, сроки и др.)", "Простота процесса получения кредита",
                "Вероятность получения кредита в банке выше, чем в прочих банках",
                "По рекомендации", "Лояльность к банку", "Другая причина",
            ],
            'xabar': [
                "Да, постоянно уведомляет", "Иногда уведомляет", "Никогда не получал уведомлений"
            ],
            'baholash': [
                "Очень удобен", "Сложный для использования", "Совсем не удобен", "Затрудняюсь ответить"
            ]
        },
        'omonatlar': {
            'first': [
                " Да, имеется в банке, обслуживающем основной счёт", "Да, имеется в другом банке", "Нет, не имеется",
            ],
            'sabab': [
                "Выгодные условия (процентная ставка, сроки и др.)", "Доверие к банку",
                "Своевременное исполнение банком условий договора (выплата процентов и др.)",
                "Простота процедур осуществления депозитных операций",
                "Лояльность к банку", "Другая причина"
            ]
        },
        'hisob': {
            'first': [
                "Выгодные условия (коммиссия за дебетовый оборот и др.)", "Доверие к банку",
                "Своевременное исполнение банком обязательств", "Качество обслуживания",
                "Лояльность к банку", "Широкий спектр предоставляемых услуг",
                "Развитость дистанционных каналов предоставления услуг", "Другая причина"
            ],
            'vaqt': [
                "Да, всегда оперативно", "Иногда приходится ждать", "Нет, постоянно задерживают платежи"
            ],
            'xato': [
                "Да, всегда бывают ошибки и неточности", "Иногда бывают ошибки и неточности",
                "Нет, всегда безошибочно"
            ]
        },
        'valyuta': {
            'first': [
                "Выгодные условия (курс обмена)", "Надежность банка", "Оперативность обслуживания", "Другое"
            ]
        }
    }
}

ANKETA_BTN_TEXT = {
    'uz': {
        'savol1': [
            "Яхши ⭐️⭐️⭐️⭐⭐️", "Қониқарли ⭐️⭐️⭐️⭐️", "Қониқарсиз ⭐️⭐️⭐️",
            "Ёмон ⭐️⭐️", "Фойдаланмаганман/Жавоб беришга қийналаман 🤷‍♂️/🤷‍♀️"
        ],
        'savol2': [
            "Умуман қониқарсиз", "Қониқарсиз", "Қониқарли", "Жудаям қониқарли", "Жавоб беришга қийналаман"
        ],
        'savol3': [
            "Яхши ⭐️⭐️⭐️⭐⭐️", "Қониқарли ⭐️⭐️⭐️⭐️", "Қониқарсиз ⭐️⭐️⭐️",
            "Ёмон ⭐️⭐️", "Жавоб беришга қийналаман 🤷‍♂️/🤷‍♀️"
        ],
        'savol4': [
            "Тўлиқ қўшиламан 👍👍", "Қисман қўшиламан 👍", "Қисман қўшилмайман 👎", "Умуман қўшилмайман 👎👎",
            "Жавоб беришга қийналаман 🤷‍♂️/🤷‍♀️"
        ],
        'savol5': [
            "Менга барчаси ёқади", "Менга ёқмайди", "Жавоб беришга қийналаман"
        ],
        'fikr': [
            'Изоҳ йўқ'
        ]
    },
    'ru': {
        'savol1': [
            "Хорошее ⭐️⭐️⭐️⭐⭐️", "Удовлетворительное ⭐️⭐️⭐️⭐️", "Неудовлетворительное ⭐️⭐️⭐️",
            "Плохое ⭐️⭐️", "Не пользовался/Затрудняюсь ответить 🤷‍♂️/🤷‍♀️"
        ],
        'savol2': [
            "Совершенно неудовлетворен", "Неудовлетворен", "Удовлетворен", "Совершенно удовлетворен",
            "Затрудняюсь ответить"
        ],
        'savol3': [
            "Хороший ⭐️⭐️⭐️⭐⭐️", "Удовлетворительный ⭐️⭐️⭐️⭐️", "Неудовлетворительный ⭐️⭐️⭐️",
            "Плохой ⭐️⭐️", "Затрудняюсь ответить 🤷‍♂️/🤷‍♀️"
        ],
        'savol4': [
            "Полностью согласен 👍👍", "Скорее согласен 👍", "Скорее не согласен 👎", "Полностью не согласен 👎👎",
            "Затрудняюсь ответить 🤷‍♂️/🤷‍♀️"
        ],
        'savol5': [
            "Мне всё нравится", "Затрудняюсь ответить", "Мне не нравится"
        ],
        'fikr': [
            'Комментариев нет'
        ]
    }
}
